app/views/posts/_post.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
		<ul id="comments-list-<%= p.id %>" class="comments-list">
			<% p.comments.each do |com| %>