app/controllers/comments_controller.rb

INSERT INTO "comments" ("post_id", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create

  	@comment = Comment.new(comment_params)
  	@comment.user = current_user
  	@comment.save