app/controllers/posts_controller.rb

  def index
    query = params[:q]
  	@post = Post.new
  	@comment = Comment.new
    if (query.blank?)
      @posts = Post.all
    else
  	 @posts = Post.where('content like ?', ('%' + query + '%')).reverse()
    end
    @users=User.all
---
SELECT "posts".* FROM "posts"
SELECT "users".* FROM "users"

  def create
  	@post = Post.new(post_params)
  	@post.user = current_user
  	@post.save
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)