app/controllers/users_controller.rb

	def show
		@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]

	def filter_by_email
		users = User.where('email like ?', ('%' + params[:term] + '%'))
---
SELECT "users".* FROM "users" WHERE (email like '%A%')